In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("E:/DATA Science - My preparation/3_Data_analytics - Pandas/Data-files/Pandas - Q1 Sales.csv")

In [3]:
df.head()

     Country Region Sales Person    Date of Purchase   Total  Quantity
0      India  North         John    4/4/2018 0:00:00  100000       567
1         US  North         Bill  12/11/2017 0:00:00  120000      3000
2         UK  North       Thomas   5/12/2016 0:00:00  140000       345
3  Australia   East         John   6/20/2011 0:00:00  160000      1000
4     Africa   East         Bill   4/12/2011 0:00:00  180000       123

In [ ]:
# MIN:-

In [ ]:
# 1. How to display "minimum" from each-field using df..?

In [4]:
df.min()

Country                        Africa
Region                           East
Sales Person                     Bill
Date of Purchase    1/24/2013 0:00:00
Total                          100000
Quantity                           85
dtype: object

In [ ]:
# 2. How to know min-value from field-->"Quantity"..?

In [5]:
df['Quantity'].min()

85

In [ ]:
# 3. How to get minimum-value from both fields = "Total & Quantity"

In [6]:
df[['Total','Quantity']].min()

Total       100000
Quantity        85
dtype: int64

In [ ]:
# MAX:-

In [ ]:
# 1. How to display "Maximum" from each-field using df..?

In [8]:
df.max()

Country                           US
Region                          West
Sales Person                  Thomas
Date of Purchase    9/2/2011 0:00:00
Total                       26000000
Quantity                        7890
dtype: object

In [ ]:
# 2. How to know max-value from field-->"Quantity"..?

In [9]:
df['Total'].max()

26000000

In [ ]:
# 3. How to get Maximum-value from both fields = "Total & Quantity"

In [10]:
df[['Total','Quantity']].max()

Total       26000000
Quantity        7890
dtype: int64

In [ ]:
# MEAN:-

In [ ]:
# 1. What happens if we do mean on df..?

In [12]:
df.mean()

# It takes only int-value & performs mean-value

C:\Users\Asus\AppData\Local\Temp\ipykernel_8920\15859895.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Total       1502500.0
Quantity        977.9
dtype: float64

In [14]:
df.head()

     Country Region Sales Person    Date of Purchase   Total  Quantity
0      India  North         John    4/4/2018 0:00:00  100000       567
1         US  North         Bill  12/11/2017 0:00:00  120000      3000
2         UK  North       Thomas   5/12/2016 0:00:00  140000       345
3  Australia   East         John   6/20/2011 0:00:00  160000      1000
4     Africa   East         Bill   4/12/2011 0:00:00  180000       123

In [ ]:
# Exercise:-

In [ ]:
# 1.  How to know the specific person[Details] who sold most..?

In [20]:
df[['Sales Person','Total','Quantity']][df['Total'] == df['Total'].max()]

  Sales Person     Total  Quantity
8       Thomas  26000000      1000

In [ ]:
# 2. How to know the specific Country who sold Least -->['Quantity']..?

In [21]:
df[['Country','Total','Quantity']][df['Quantity'] == df['Quantity'].min()]

      Country   Total  Quantity
18     Africa  140000        85
19  Singapore  150000        85

In [ ]:
# Selling Ratio:-

In [ ]:
# 1. How to find selling ratio using df..?
#      ""Selling ratio = Total / Quantity""

In [22]:
df['Selling Ratio'] = df['Total'] / df['Quantity']

In [23]:
df.head()

,Country,Region,Sales Person,Date of Purchase,Total,Quantity,Selling Ratio
0,India,North,John,4/4/2018 0:00:00,100000,567,176.366843
1,US,North,Bill,12/11/2017 0:00:00,120000,3000,40.000000
2,UK,North,Thomas,5/12/2016 0:00:00,140000,345,405.797101
3,Australia,East,John,6/20/2011 0:00:00,160000,1000,160.000000
4,Africa,East,Bill,4/12/2011 0:00:00,180000,123,1463.414634

In [ ]:
# 2. How to know "minimum-value" of selling ratio..?

In [24]:
df[['Sales Person','Total','Quantity','Selling Ratio']][df['Selling Ratio'] == df['Selling Ratio'].min()]

  Sales Person   Total  Quantity  Selling Ratio
1         Bill  120000      3000           40.0

In [ ]:
# 3. How to know "maximum-value" of selling ratio..?

In [25]:
df[['Sales Person','Total','Quantity','Selling Ratio']][df['Selling Ratio'] == df['Selling Ratio'].max()]

  Sales Person     Total  Quantity  Selling Ratio
8       Thomas  26000000      1000        26000.0

In [ ]:
# PERCENTAGE:-

In [ ]:
# 1. How to add Bonus of 10% to df..?
#        ""Bonus = Total / 10""

In [26]:
df['Bonus'] = df['Total'] / 10

In [27]:
df.head()

,Country,Region,Sales Person,Date of Purchase,Total,Quantity,Selling Ratio,Bonus
0,India,North,John,4/4/2018 0:00:00,100000,567,176.366843,10000.0
1,US,North,Bill,12/11/2017 0:00:00,120000,3000,40.000000,12000.0
2,UK,North,Thomas,5/12/2016 0:00:00,140000,345,405.797101,14000.0
3,Australia,East,John,6/20/2011 0:00:00,160000,1000,160.000000,16000.0
4,Africa,East,Bill,4/12/2011 0:00:00,180000,123,1463.414634,18000.0

In [ ]:
# CORRELATION:-

In [28]:
# Provides us "correlation-matrix" of all Numerical-column

df.corr()

                  Total  Quantity  Selling Ratio     Bonus
Total          1.000000  0.031260       0.984196  1.000000
Quantity       0.031260  1.000000      -0.070494  0.031260
Selling Ratio  0.984196 -0.070494       1.000000  0.984196
Bonus          1.000000  0.031260       0.984196  1.000000

In [ ]:
# NOTE:-
#    1. Positive correlation[1.000]   - Matches perfectly
#    2. Medium correlation  [0.0213]  - Doesn't match perfectly
#    3. Negative Correlation[-0.0709] - if one value increase & other value decrease

In [ ]:
# NOTE:-
#  1.Total & Selling Ratio    ---> Very-Good Correlation ratio
#  2.Quantity & Selling Ratio ---> Negative Correlation ratio

In [ ]:
# 1. How to find correlation for selective fields
#     (Total & Quantity)...?

In [29]:
df[['Total','Quantity']].corr()

            Total  Quantity
Total     1.00000   0.03126
Quantity  0.03126   1.00000

In [31]:
df[['Total','Selling Ratio']].corr()

                  Total  Selling Ratio
Total          1.000000       0.984196
Selling Ratio  0.984196       1.000000

In [ ]:
# Here "Total"  &  "Selling Ratio" --> positive correlated(Very_Good_Match)